[
  {
    "title": "CRISTAL · The Rise & Fall of a Showgirl",
    "date": "2024-02-08",
    "genre": "CRISTAL · The Rise & Fall of a Showgirl- A Body & Pole Showcase  #SHOW @HOY",
    "location": "House of Yes",
    "time": "Thursday, February 8 · 7 - 10pm EST",
    "price": "$52.17",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F664270099%2F1379517817233%2F1%2Foriginal.20231228-194413?w=600&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C0%2C2000%2C1000&s=40019a7ff4e085975e0cec7e8d348fac",
    "excerpt": "Cristal is a gifted dancer determined to etch her name on the Las Vegas strip.\nUpon meeting a like-minded producer, they decide to join forces to make the fabled Stardust Hotel home to their avaricious ambitions.\nWhen Cristal meets the spotlight-hungry Nomi her vengeful side takes over.\nWill Cristal’s talent be enough to own the night, or will Nomi claw her way to the top and steal the spotlight?\nDoors at 7 pm | Show at 8 pmSeating is not guaranteed after 8 pm\n⫸ GET ON THE LISTSubscribe to the House of Yes newsletter for first access to tickets and special invites: www.houseofyes.org/yesemails··········································································································◆SAFER SPACES POLICY◆House of Yes is a space for everyone to feel welcome. We have a zero tolerance policy for harassment, unwanted touch, and discrimination. Always ASK before touching anyone at our events. If someone is making you uncomfortable, speak to a security guard or ask for a manager. We will believe you, and we will help. All restrooms in our venue are gender neutral. The entrance to the venue is ADA accessible. Strobe lights are used during performances and parties. Find out more at houseofyes.org/SAFER\n◆CONTENT WARNING◆The performances and acts of artistic expression at House of Yes events may include portrayals of explicit actions, theatrical violence, bodily harm and physical risk that is often found in circus, sideshow or similar forms of performance art. The performances often explore adult subject matter. The views expressed in performances do not necessarily reflect that of House of Yes or its owners. We understand that these acts are not for everyone, so please use your own discretion. If you have questions about the content of our shows, please contact info@houseofyes.org\n◆INFO & FAQ◆21+ | No Re-Entry | No Refunds| More questions? Check out: houseofyes.org/FAQ",
    "isFeatured": false,
    "rating": 0
  },
  {
    "title": "DIRTY THURSDAY ·  Bad B!tch Energy",
    "date": "2024-02-08",
    "genre": "House of Yes presents Dirty Thursday every Thursday!\nFree before Midnight with RSVP | $10 Presale | $﻿15 at the Door\n#PARTY  @HOY",
    "location": "House of Yes",
    "time": "February 8 · 10pm - February 9 · 4am EST",
    "price": "$0 – $11.98",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F612237829%2F1379517817233%2F1%2Foriginal.20231003-192224?w=600&auto=format%2Ccompress&q=75&sharp=10&rect=22%2C0%2C2196%2C1098&s=533872ed8dff082d954ac5bb239289f4",
    "excerpt": "It’s Dirty. It’s Thursday. You know what to do!Dress up, show up, flaunt it hard and be the star you are.Dirty Thursday is our weekly turn-up, giving you a fresh theme each week, designed to make you DANCE.This week we’re serving Bad Bitch Energy - in honor of the women who inspire us to turn it on, turn it up and turn it out. Be your best baddie, show your love and give zero fucks. ⫸ MUSICBrought to you by our resident DJ -  DirtyfingerPlaying the hits and  deep cut mixes from Cardi B, Megan Thee Stallion, Doja Cat, City Girls, Nicki Minaj, GloRilla, Lakeyah, Lizzo, Beyonce, Janet Jackson, Whitney Houston, Aaliyah, Toni, Lauryn Hill, Mariah, Ariana Grande, Britney, TLC and so so so many more.Free before Midnight with RSVP | $10 Presale | $﻿15 at the Door⫸ LOOKSDress up, show up, flaunt it hard and be a star. See more inspiration HERE.Be Dirty. Dance yourself clean. ⫸ M﻿USICDirtyfinger⫸  PARTY TABLES  YES! We offer table packages for groups, special celebrations or just because you're fabulous. Contact reservations@houseofyes.org to book yours!⫸ GET ON THE LIST Subscribe to the House of Yes newsletter for first access to tickets and special invites: www.houseofyes.org/yesemails ··········································································································◆SAFER SPACES POLICY◆House of Yes is a space for everyone to feel welcome. We have a zero tolerance policy for harassment, unwanted touch, and discrimination. Always ASK before touching anyone at our events. If someone is making you uncomfortable, speak to a security guard or ask for a manager. We will believe you, and we will help. All restrooms in our venue are gender neutral. The entrance to the venue is ADA accessible. Strobe lights are used during performances and parties. Find out more at houseofyes.org/SAFER◆INFO & FAQ◆21+ | No Re-Entry | No Refunds| More questions? Check out: houseofyes.org/FAQ ",
    "isFeatured": false,
    "rating": 0
  },
  {
    "title": "KRATER NYFW Radical Fashion: Abby Echiverri · Bryan Kasenic · Kim Anh",
    "date": "2024-02-09",
    "genre": "House of Yes presents  Krater III\n#SHOW @HOY",
    "location": "House of Yes",
    "time": "Friday, February 9 · 7 - 10pm EST",
    "price": "From $23.46",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F671086699%2F1379517817233%2F1%2Foriginal.20240109-224404?w=600&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C0%2C2160%2C1080&s=04b49166d542c007d62aacee49c7802b",
    "excerpt": "KRATER is a vessel where imagination transcends itself. Fearlessly challenging the conventional fashion landscape and embracing the harmonious intersection of sustainable fashion design, performance art, and electronic music, the incubator’s third event brings New York Fashion Week to Bushwick’s House of Yes, featuring an array of emerging designers and some of the city’s top selectors.Designers debuting new collections through a series of disruptive fashion performances include Hesta from NYC, a Project Runway Season 17 runner-up; Aguirrrre from Argentina and Mexican-Filipino Casa Lizarraga, both instrumental figures in the design process for KidSuper; Lakras from Colombia, renowned for a successful collaboration with the independent marketplace Apoc Store; and Ohh Baby from Pittsburgh, featured in the “The Andy Warhol Museum's \"Join The Family,\" Campaign honoring creatives deeply engaged in Pittsburgh’s artistic community.KRATER will be hosted by the Colombian duo of KRATER founder Giselle Manzano, and visual artist, DJ, and producer Vile Sanchez. Giselle will also be part of an exclusive pop-up market alongside our designers, offering you the opportunity to directly purchase their unique pieces right at the event.Abby Echiverri of LCD Soundsystem and The Bunker, Kim Anh of Can U Not Talk Records and Calvin Klein, and Bryan Kasenic of The Bunker and Krater will play DJ sets throughout the night and at the afterparty. Join us on Friday, February 9, from 7 pm to 10 pm for the main event. The DJs will be playing an afterparty for ticket holders in HOY’s Onyx room after the main event from 10 pm to 4 am.\n⫸  FURTHER INFORMATION:Welcome to KRATER, pronounced \"KRAH-TER\" – a vessel where imagination transcends itself. We stand as an artistic incubator, fearlessly challenging the conventional fashion landscape by embracing the harmonious intersection of sustainable fashion design, performance art, and electronic music. At KRATER, we champion a collective of artists and designers who not only embrace intersectionality but redefine it, defying norms and purposefully blurring the lines between fashion and art. Our mission is clear – to compel all to perceive creativity not as a static concept but as a dynamic and transformative force. Intersectional artists within our realm navigate the intricate landscape of social identities, recognizing the interconnected nature of race, gender, sexuality, nationality, religion, socio-economic status, and disability among others within their creative expression. These creators adopt a multidisciplinary approach in their artistic practices, seamlessly weaving together sustainable fashion design, and performance art transcending traditional boundaries. Through their works, they reflect the kaleidoscope of the human experience, amplifying voices often muted in mainstream narratives. Their art is a resonant tool for social commentary, illuminating the complex intersections of identity and fostering a dialogue that catalyzes empathy and societal transformation. Our event proudly stands as a cost-free platform for creatives. Establishing this platform during New York Fashion Week is not just a choice; it is a declaration. It is a vital step towards championing inclusivity and diversity, a deliberate move to eliminate financial barriers and ensure equal opportunities for talented designers from marginalized backgrounds. This initiative signifies more than a positive shift; it is a seismic change towards a fashion landscape that is equitable, representative, and fiercely rejecting historical exclusivity. As a self-produced event, we depend on our community to breathe life into our vision, with ticket sales directly fueling the realization of our event. This underscores the collaborative effort required to bring forth our collective vision, supporting designers and artists in turning their creative dreams into a vibrant reality. In KRATER, we find not just an event but a living testament to the transformative power of unity and creative expression.\n⫸  PRESSPAPER MAGAZINENOKILLMAGBUSHWICK DAILYCANVAS REBEL\n⫸  DESIGNERS & ARTISTS\nAGUIRRRRE\nAGUIRRRRE, established by the Argentinian designer Sabrina Aguirre, is a profound exploration into the reconceptualization of corporeity through the lens of cultural traditions. The brand challenges the notion that the construction of the body is solely physical, recognizing its deeply rooted cultural dimensions and pushing these boundaries.Sabrina ingeniously utilizes cultural traditions to construct a new reality, defying established limits and bringing designs into the realm of intersectional contemporaneity. Embracing a foundation of upcycling, the majority of the garments are crafted from textile waste, showcasing a vibrant palette of colors and diverse textures. Within her creations, a perpetual duality exists—a homage to cultural traditions of a formative past, juxtaposed with a present that unfolds in continuous evolution. This juxtaposition becomes a living narrative within each piece.Sabrina has notably contributed to the design and styling team for KID SUPER FW21 during Paris Fashion Week. Her designs have adorned artists such as Cardi B, Sofia Thompson, and she has engaged in collaborative projects with esteemed names like CHRISHABANA for Rupaul’s Drag Race, Willy Chavarria, and Lil Nas.As a testament to AGUIRRRRE's significance in the fashion landscape, the brand is proudly affiliated with Not Just a Label, an influential online platform and community that serves as a global showcase for emerging fashion designers. This collaboration further amplifies AGUIRRRRE's reach, positioning it at the forefront of the international fashion scene.\nCASA LIZARRAGA \nCasa Lizarraga, founded by Mexican-Filipino Designer and Artist  Cecilia Lizarraga, stands as a visionary luxury fashion house seamlessly marrying opulence with a deep commitment to sustainability and empowerment. Specializing in handcrafted creations that transcend the ordinary, they take pride in crafting custom garments that reflect individuality and style.The ethos of CL extends beyond fashion, ingrained in their commitment to empowering people of color, fostering inclusivity, and championing ethical practices throughout the supply chain. Casa Lizarraga is more than a label; it's a celebration of diversity, a testament to sustainable luxury, and a canvas for personal expression—your destination for exclusive, sustainable luxury that leaves a lasting impression.Cecilia has participated in significant collaborations, contributing to notable projects alongside Colm Dillane, known as KIDSUPER. She played a vital role in his design team, helping create key pieces for Kid Super's Louis Vuitton collection. Additionally, she has collaborated with American Designer Elena Velez, and her clientele includes celebrities such as J Balvin, Kate Moss, Eve, Connie Diamond, among others. \nHESTA\nHester Sunshine, an innovative Queer Jewish apparel creator, has made a significant impact in the industry. With notable experiences at renowned brands like Betsey Johnson and Kate Spade, Hester secured the runner-up position in Season 17 of Project Runway with the Y20k0 collection. Leading HESTA, a gender-nonconforming ready-to-wear (RTW) and couture line, Hester envisions a future fashion landscape focused on inclusivity and innovation.HESTA is dedicated to crafting ethically produced, beautiful garments for all body types, challenging the exclusivity often associated with high fashion. Embracing diversity, the brand tailors designs for real people with real bodies, including curves, trans bodies, and various shapes and sizes.As an anti-establishment, pro-customer brand, HESTA seeks to revolutionize the fashion narrative, encouraging individuals not just to wear clothes but to celebrate their unique forms. Serving as a safe space for self-expression and empowerment, HESTA bridges the gap between fashion and real-life functionality.Hesta's creations have adorned luminaries such as Rebecca Black, Rify Royalty, Kat Cunning, Landry Bender, Sudan Archives, and Bishme Cromartie. Featured in publications like NYLON Magazine, Image Magazine, Moevir, among others, Hester has also collaborated with the immersive art collective Meow Wolf, known for blending fantasy, science fiction, and surrealism in interactive art experiences.\nLAKRAS\nFounded and led by Colombian designer Maria Alejandra Caicedo, known as Alek, Lakras is a unique brand exploring the intersections of fashion, art, and crafts. Breaking traditional boundaries, the Colombian label creates pieces for exhibition-sale or collaboration with other artistic projects.Lakras serves as a creative laboratory for modified garments, accessories, unconventional fabrics, and experiential pieces, celebrating imperfections and blurring the lines between reality, fiction, and mythology. Emphasizing affection and collaboration, Lakras prioritizes handmade creations over mass production, adding a human touch to each piece.More than just a brand, Lakras represents the avant-garde of Colombian-inspired couture, synthesizing craft, experimental design, and historic imagery. It acts as a contemporary portal into Latin American heritage, resonating with those seeking exclusive and imaginative fashion statements.Lakras has just launched a collaboration with Apoc Store, now accessible for purchase on the online marketplace specializing in independent fashion, design, and art. The brand has garnered recognition in publications like Glitch Magazine, Voyage LA, El Espectador, and London Weekly Journal, among others.\nOOH BABY \nSince its establishment in 2018 by the innovative designer Anika Ignozzi, Ooh Baby has rapidly become a symbol of expressive, vibrant, and eco-conscious fashion. Specializing in upcycled clothing and operating from its dynamic Brooklyn studio, the brand has evolved into a creative hub for thoughtfully designed collections.The creation of wearable art was driven by a commitment to self-expression, a key factor that defines the uniqueness of Ooh Baby's designs. Anika's wearable art has found its way onto celebrities like Bebe Rexha, Norah Jones, Wyatt Oleff, Ski Mask the Slump God, Justin Quiles, Jhay Cortez, and many more.Originating in Pittsburgh, Ooh Baby has transformed from humble pop-up stands to storefronts, now establishing a presence in the heart of New York City on Greenwich Avenue. The brand has graced prestigious events, including Pittsburgh Fashion Week and New York Fashion Week, and is gearing up for the launch of its upscale manufactured collection, \"Imagination Activation.\" Ooh Baby's recent feature in The Andy Warhol Museum's \"Join the Family\" campaign is a testament to Ignozzi's rebellious spirit, showcased on a Warhol billboard. This campaign honors creatives deeply engaged in Pittsburgh's artistic community.Anika Ignozzi's dedication to her craft and innovation has been recognized through her receipt of the Chashama Storefront Start-Up Program. This program supports small businesses with free pop-up storefronts, contributing to the restoration of financial stability and injecting commerce, beauty, and hope back into New York City.\n⫸  DJS \nABBY ECHIVERRI \nAbby Echiverri, a young producer based in Brooklyn, NY, is a multifaceted artist, seamlessly navigating roles as a musician, sound engineer, DJ, and VJ. Her musical journey includes contributing a track to the \"15 Years of the Bunker\" compilation and releasing her debut EP, \"Ab Initio,\" on The Bunker NY, earning acclaim from reviewers. As a live musician, Echiverri blends left-field influences, skillful hardware manipulations, and seasoned engineering to offer an innovative take on techno.Her musical odyssey began in childhood with classical training in violin, flute, piano, and vocals, establishing music as an integral part of her daily life. High school saw her venture into turntables and record collecting, leading her to NYC to study recording engineering and perform in post-punk bands. An early enthusiast of Wierd and The Bunker, Echiverri has since dedicated her professional hours to engineering, maintaining, and manufacturing audio equipment for studios and clubs worldwide. This deep connection with technology echoes in her music, where she explores unfamiliar hardware, utilizes acoustic samples, employs unconventional effects processing, and manipulates the stereo field in disorienting ways.\nBRYAN KASENICFor the past 21 years, The Bunker New York has led the way for American techno by bringing together hundreds of artists from all over the world. More than a mere techno party, The Bunker unites diverse sounds from across the electronic music spectrum, connecting the dots between house, techno, experimental sounds, and much more. The Bunker New York began as a party, grew up into a record label, and has become a collaborative community centered around a 501(c)3 non-profit organization, fostered by founder and curator Bryan Kasenic since its launch in 2003.Bryan is also the co-founder and Music Director of KRATER. \n\nKIM ANHKim Anh, a prominent American DJ and producer, has been a driving force in the queer dance music underground for over a decade. As a first-generation daughter of an immigrant, she has left an indelible mark on the nightlife scenes of Los Angeles and New York. Founding groundbreaking queer parties like Booby Trap! and Tendencies, Kim Anh emphasizes the rich history of dance music, reconnecting it with its roots.Her production and songwriting skillfully blend classic house and disco with a contemporary flair, featuring catchy hooks and edgy, sensual lyrics. Recognized by DJ Mag as \"lucid and absorbing, conveying an assertion and power,\" she has achieved top 10 status on Beatport. With features in Mix Mag, DJ Mag, Resident Advisor, and LA Weekly, Kim Anh's influence extends globally.Kim Anh is the founder of Can U Not Talk Records and has collaborated with renowned artists like Roy Davis. Jr, Massimiliano Pagliara, Peaches, and Cerrone. Beyond music, she has composed original scores for film and runway shows and serves as a consulting Global Music Supervisor at Calvin Klein.An activist and community organizer, Kim Anh supports organizations like the Los Angeles LGBT Center, Harvey Milk Foundation, and GLAAD. Her efforts have raised over one million dollars, emphasizing the vital connection between queer culture and nightlife. This commitment remains central to her role as a recording artist, DJ, producer, and composer.\n⫸   HOSTED BY\nVile SanchezOriginally from Medellin, Colombia, and now based in New York City, Vile Sanchez is a versatile artist whose work is a fusion of visual art, DJing, and music production. Inspired by the essence of existence, sacred geometry, and the diverse expressions of human emotion through art, Sanchez’s creations transcend boundaries. Her art and music invite audiences to explore life as an art form, where intricate visuals and emotive soundscapes intersect to evoke contemplation on the mysteries of existence.\nGiselle ManzanoGiselle Manzano Ramírez, is a Colombian designer and multidisciplinary artist. Her mission revolves around empowering individuals through the medium of fashion, utilizing garments as a canvas to convey profound meaning and evoke emotions. Going beyond traditional boundaries, Giselle merges art with fashion, exploring unconventional printmaking techniques and surface embellishments to create unique and captivating works.\nHer artistic journey has led her to showcase her creations at prestigious events such as Brooklyn Fashion Week, ReFashion Week, Bartschland, and KRATER. Collaborating with emerging artists and DJs within the underground music scene, Giselle serves as both a designer and stylist, curating unforgettable looks for DJs performing at renowned venues like Dekmantel, Boiler Room, and The Bunker. She brings her vision to life in legendary clubs such as Berghain, Basement, and Bossa Nova Civic Club, leaving an indelible mark on the fashion landscape and empowering individuals through her creative expression.Giselle's expertise has recently been recognized as she joined the esteemed roster of Domestika, the rapidly growing creative community. This platform allows the most talented creative experts to share their knowledge and skills through meticulously crafted online courses.\nGiselle is the founder of Krater.Flyer design by Giselle Manzano featuring the digital art of Colombian designer Julian Guzman \n⫸ PARTY TABLESYES, we offer table packages for groups, special celebrations or just because you're fabulous. Reserve yours directly atreservations@houseofyes.org\n⫸ GET ON THE LISTSubscribe to the House of Yes newsletter for first access to tickets and special invites: www.houseofyes.org/yesemails··········································································································◆SAFER SPACES POLICY◆House of Yes is a space for everyone to feel welcome. We have a zero tolerance policy for harassment, unwanted touch, and discrimination. Always ASK before touching anyone at our events. If someone is making you uncomfortable, speak to a security guard or ask for a manager. We will believe you, and we will help. All restrooms in our venue are gender neutral. The entrance to the venue is ADA accessible. Strobe lights are used during performances and parties. Find out more at houseofyes.org/SAFER\n◆INFO & FAQ◆21+ | No Re-Entry | No Refunds| More questions? Check out: houseofyes.org/FAQ\n",
    "isFeatured": false,
    "rating": 0
  },
  {
    "title": "LOVER'S BALL with GLAMCOCKS · Clinton Foster · Joe D'Espinosa · Denton",
    "date": "2024-02-09",
    "genre": "House of Yes presents Glamcocks · A Burningman Camp Fundraiser #PARTY @HOY",
    "location": "House of Yes",
    "time": "February 9 · 10pm - February 10 · 4am EST",
    "price": "From $11.98",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F671041299%2F1379517817233%2F1%2Foriginal.20240109-214831?w=600&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C0%2C2160%2C1080&s=2dc95d26cd7ef2b69d824e0e55cbc5ad",
    "excerpt": "Glamcocks presents LOVERS BALL at House of Yes!A Burningman Camp Fundraiser\nCalling all Lovers of every kind - let us open your heart, your mind, your h0le, and your soul on the dancefloor of glamour & amour!Be your own Lover or bring your bad romance, your kinky ex, your fantasy FWB. Bring your questionable situationship, your super cute sidepiece, your alter ego’s mistress, Bring your throuple crush, your zaddy dom, your bestie baddie, all of it. Everyone. Share the LOVE! Love is LOVE and Balls are a BALL!\n⫸ LOOKSRed on red. Pink on pink · latex & leather · skin & shimmer · lucky lingerie · elegant extravaganza · kinky queen · big dad energy · baddie body · darling dolls · aro chic · genderfvck fits · fishnet fantasy · clowns and gowns · opulent everything · zaddy’s panties · drag royalty · romantique AF · whatever makes you feel beautiful and loved. Inspo HERE: https://pin.it/6WiYwpH\n⫸MUSICClinton FosterTech house and disco DJ spinning high-energy house beats that make you move!Joe D'EspinosaMerging disco grooves and funky house sounds for melodic and uplifting journeys on dancefloors.DentonHigh-energy house music, blending together the grooves of Burning Man with the fun of Fire Island.\n⫸ABOUT GLAMCOCKS!“We are a far-flung, but tight-knit family of burners and creatives, and our gatherings are a reflection of our queer, exuberant, life-loving, and carefree attitude. We wish to cultivate great connections and memories for all who stumble upon us. We strive to create a fun, energetic, body-positive, open-minded, and pro-LGBTQIA+ space that invites participation and self-expression for everyone who wants to connect with creative community. We love meeting new people, sharing our experiences, and expanding our roost!” - love, Glamcocks\n⫸ PARTY TABLESYES, we offer table packages for groups, special celebrations or just because you're fabulous. Reserve yours directly at reservations@houseofyes.org\n\n⫸ GET ON THE LISTSubscribe to the House of Yes newsletter for first access to tickets and special invites: www.houseofyes.org/yesemails··········································································································◆SAFER SPACES POLICY◆House of Yes is a space for everyone to feel welcome. We have a zero tolerance policy for harassment, unwanted touch, and discrimination. Always ASK before touching anyone at our events. If someone is making you uncomfortable, speak to a security guard or ask for a manager. We will believe you, and we will help. All restrooms in our venue are gender neutral. The entrance to the venue is ADA accessible. Strobe lights are used during performances and parties. Find out more at houseofyes.org/SAFER\n◆INFO & FAQ◆21+ | No Re-Entry | No Refunds| More questions? Check out: houseofyes.org/FAQ\n",
    "isFeatured": false,
    "rating": 0
  },
  {
    "title": "DIRTY CIRCUS · Variety Show",
    "date": "2024-02-10",
    "genre": "House of Yes presents Dirty Circus, our longest-running variety show #SHOW @HOY",
    "location": "House of Yes",
    "time": "Saturday, February 10 · 6:30 - 9:30pm EST",
    "price": "$57.90 – $750",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F661701419%2F1379517817233%2F1%2Foriginal.20231220-205618?w=600&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C0%2C2160%2C1080&s=d62073184ebd8635fb94426d86f1cd7e",
    "excerpt": "A variety show dedicated to the raw & the raunchy.Aerial. Circus. Absurdity.Skill. Hilarity. Brilliance.The finest, fittest and most ferocious performers, curated to perfection and presented on our stage for your enjoyment.Crafted & curated by House of Yes Co-Founder Anya Sapozhnikova.Told in 3 acts, not for the faint of heart.Shows like Dirty Circus are our Heart and Soul. They allow us to showcase the best talent in the entire city, and bring it to you at a fraction of the cost. Because we love you.⫸ PERFORMERSPixel the Drag JesterMichael MomentumBlaine PetroviaAndrea Nicole OrtizFrancoise VorangerHybrid Movement CompanySweaty EddieRichardAnya Sapozhnikova\n⫸ CABARET TABLES : YES! We offer table packages for groups, special celebrations or just because you're fabulous. Contact reservations@houseofyes.org to book yours!⫸ SPA SEATING: At every Dirty Circus show, one lucky guest (+ whoever they invite with them) will have the opportunity to have an unforgettable experience of watching the show from the best seat in the house - our vintage clawfoot bathtub! As part of this spa seating we will pamper you with handmade bubbles, fresh towels, personal butler and other surprises. Access to this seating starts 30 min before showtime. Get here early.⫸ SPLASH ZONE: Occasionally, we get extra messy at Dirty Circus. Some acts may include water. We will clearly mark all seats that fall within the splash zone, so you can make an informed decision about just how wet you want to get.Doors at 6:30pm | Show at 7:30pmSeating is not guaranteed after 7:30pm\n⫸ GET ON THE LISTSubscribe to the House of Yes newsletter for first access to tickets and special invites: www.houseofyes.org/yesemails··········································································································◆SAFER SPACES POLICY◆House of Yes is a space for everyone to feel welcome. We have a zero tolerance policy for harassment, unwanted touch, and discrimination. Always ASK before touching anyone at our events. If someone is making you uncomfortable, speak to a security guard or ask for a manager. We will believe you, and we will help. All restrooms in our venue are gender neutral. The entrance to the venue is ADA accessible. Strobe lights are used during performances and parties. Find out more at houseofyes.org/SAFER\n◆CONTENT WARNING◆The performances and acts of artistic expression at House of Yes events may include portrayals of explicit actions, theatrical violence, bodily harm and physical risk that is often found in circus, sideshow or similar forms of performance art. The performances often explore adult subject matter. The views expressed in performances do not necessarily reflect that of House of Yes or its owners. We understand that these acts are not for everyone, so please use your own discretion. If you have questions about the content of our shows, please contact info@houseofyes.org\n◆INFO & FAQ◆21+ | No Re-Entry | No Refunds| More questions? Check out: houseofyes.org/FAQ",
    "isFeatured": false,
    "rating": 0
  },
  {
    "title": "CHIC · Apache · Cisummi · Deroos",
    "date": "2024-02-10",
    "genre": "House of Yes presents Chic\n#PARTY@HOY",
    "location": "House of Yes",
    "time": "February 10 · 10pm - February 11 · 4am EST",
    "price": "$0 – $46.42",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F669924079%2F1379517817233%2F1%2Foriginal.20240108-172950?w=600&auto=format%2Ccompress&q=75&sharp=10&rect=2%2C0%2C2040%2C1020&s=0a6dc4cacf9a39abdc02306a274ddea6",
    "excerpt": "\"Fashion is the armor to survive the reality of everyday life.\"( Bill Cunningham)\"Fashion should be a form of escapism, and not a form of imprisonment.\"( Alexander McQueen)\"In difficult times, fashion is always outrageous.\" (Elsa Schiaparelli)\"Fashion is a movie. Every morning when you get dressed, you direct yourself.\"(Thierry Mugler)\n⫸ LOOKSYou heard the fashion gods. Please don’t disappoint. But also, don’t wear it, unless you can dance in it.\n⫸MUSICApache“I want my emotions and energy to travel through the ears of my listeners and touch their hearts and soul. Get you to imagine yourself dancing in the desert on sand dunes at sunrise...- That’s how my sound works”. - ApacheCisummiHis music curation is the reflection of his most inspiring travels and a graceful ode to all ethnies.DeroosInspired by many genres of music, project deroos is a display of his wide range of musical taste.\n⫸EXPERIENCESFashion all over the place.\n⫸ PARTY TABLESYES, we offer table packages for groups, special celebrations or just because you're fabulous. Reserve yours directly at reservations@houseofyes.org\n⫸ GET ON THE LISTSubscribe to the House of Yes newsletter for first access to tickets and special invites: www.houseofyes.org/yesemails··········································································································◆SAFER SPACES POLICY◆House of Yes is a space for everyone to feel welcome. We have a zero tolerance policy for harassment, unwanted touch, and discrimination. Always ASK before touching anyone at our events. If someone is making you uncomfortable, speak to a security guard or ask for a manager. We will believe you, and we will help. All restrooms in our venue are gender neutral. The entrance to the venue is ADA accessible. Strobe lights are used during performances and parties. Find out more at houseofyes.org/SAFER\n◆INFO & FAQ◆21+ | No Re-Entry | No Refunds| More questions? Check out: houseofyes.org/FAQ",
    "isFeatured": false,
    "rating": 0
  },
  {
    "title": "RAW BURLESQUE · Valentines Day Edition ·Early Show",
    "date": "2024-02-14",
    "genre": "RAW BURLESQUE · Valentines Day Edition #SHOW @HOY #LUST",
    "location": "House of Yes",
    "time": "Wednesday, February 14 · 7 - 9:30pm EST",
    "price": "$57.90 – $750",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F683659669%2F1379517817233%2F1%2Foriginal.20240126-212335?w=600&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C0%2C2160%2C1080&s=3b01d35d2277c60e8081de7d4fc590ea",
    "excerpt": "This is RAW Burlesquem· Valentine’s Edition!A live show of the fearless and the filthy. Artists thrown on stage in all levels of undress backed by a blaring horn section and honey-dipped chanteuse. Raunchy. Raucous. Raw. Everything you ever wanted.Calling this Burlesque is an understatement this will be a proper circus slvt festival.\n⫸ SHOWTIMES:First Show: 7pm doors | 8pm show\n⫸ PERFORMERSOnly the best for you, full line up coming your way soon!\n⫸ GET ON THE LISTSubscribe to the House of Yes newsletter for first access to tickets and special invites: www.houseofyes.org/yesemails··········································································································◆SAFER SPACES POLICY◆House of Yes is a space for everyone to feel welcome. We have a zero tolerance policy for harassment, unwanted touch, and discrimination. Always ASK before touching anyone at our events. If someone is making you uncomfortable, speak to a security guard or ask for a manager. We will believe you, and we will help. All restrooms in our venue are gender neutral. The entrance to the venue is ADA accessible. Strobe lights are used during performances and parties. Find out more at houseofyes.org/SAFER\n◆CONTENT WARNING◆The performances and acts of artistic expression at House of Yes events may include portrayals of explicit actions, theatrical violence, bodily harm and physical risk that is often found in circus, sideshow or similar forms of performance art. The performances often explore adult subject matter. The views expressed in performances do not necessarily reflect that of House of Yes or its owners. We understand that these acts are not for everyone, so please use your own discretion. If you have questions about the content of our shows, please contact info@houseofyes.org\n◆INFO & FAQ◆21+ | No Re-Entry | No Refunds| More questions? Check out: houseofyes.org/FAQ",
    "isFeatured": false,
    "rating": 0
  },
  {
    "title": "RAW BURLESQUE · Valentines Day Edition ·Late Show",
    "date": "2024-02-14",
    "genre": "RAW BURLESQUE · Valentines Day Edition #SHOW @HOY #LUST",
    "location": "House of Yes",
    "time": "February 14 · 10pm - February 15 · 1am EST",
    "price": "$57.90 – $750",
    "image": "https://img.evbuc.com/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F683659489%2F1379517817233%2F1%2Foriginal.20240126-212320?w=600&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C0%2C2160%2C1080&s=4cac94cff057a558f30c12131ee5912a",
    "excerpt": "This is RAW Burlesquem· Valentine’s Edition!A live show of the fearless and the filthy. Artists thrown on stage in all levels of undress backed by a blaring horn section and honey-dipped chanteuse. Raunchy. Raucous. Raw. Everything you ever wanted.Calling this Burlesque is an understatement this will be a proper circus slvt festival.\n⫸ SHOWTIMES:Late Show: 10pm doors | 10:30 show\n⫸ PERFORMERSOnly the best for you, full line up coming your way soon!\n⫸ GET ON THE LISTSubscribe to the House of Yes newsletter for first access to tickets and special invites: www.houseofyes.org/yesemails··········································································································◆SAFER SPACES POLICY◆House of Yes is a space for everyone to feel welcome. We have a zero tolerance policy for harassment, unwanted touch, and discrimination. Always ASK before touching anyone at our events. If someone is making you uncomfortable, speak to a security guard or ask for a manager. We will believe you, and we will help. All restrooms in our venue are gender neutral. The entrance to the venue is ADA accessible. Strobe lights are used during performances and parties. Find out more at houseofyes.org/SAFER\n◆CONTENT WARNING◆The performances and acts of artistic expression at House of Yes events may include portrayals of explicit actions, theatrical violence, bodily harm and physical risk that is often found in circus, sideshow or similar forms of performance art. The performances often explore adult subject matter. The views expressed in performances do not necessarily reflect that of House of Yes or its owners. We understand that these acts are not for everyone, so please use your own discretion. If you have questions about the content of our shows, please contact info@houseofyes.org\n◆INFO & FAQ◆21+ | No Re-Entry | No Refunds| More questions? Check out: houseofyes.org/FAQ",
    "isFeatured": false,
    "rating": 0
  }
]